backend/app/controllers/api/v1/values_controller.rb

SELECT "values".* FROM "values"
---
  def index
    values = Value.all()

INSERT INTO "values" ("original", "calculated", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["original", 2.0], ["calculated", 16.0], ["created_at", "2023-08-16 08:05:55.995043"], ["updated_at", "2023-08-16 08:05:55.995043"]]
---
  def create
    original_value = value_params[:original].to_f
    calculated_value = (value_params[:original].to_f * 2) **2
    value = Value.new(original: original_value, calculated: calculated_value)
    if value.save

SELECT "values".* FROM "values" WHERE "values"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    value = Value.find(params[:id])

SELECT "values".* FROM "values" WHERE "values"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "values" SET "original" = ?, "calculated" = ?, "updated_at" = ? WHERE "values"."id" = ?  [["original", 3.0], ["calculated", 81.0], ["updated_at", "2023-08-16 04:55:28.289850"], ["id", 2]]
---
  def update
    value = Value.find(params[:id])
    if value
      value.update(original: params[:original], calculated: params[:calculated])

SELECT "values".* FROM "values" WHERE "values"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "values" WHERE "values"."id" = ?  [["id", 17]]
---
  def destroy
    value = Value.find(params[:id])
    if value
      value.destroy